In [3]:
people = {
    'first': ['Corey', 'Jane', 'Hale'],
    'last': ['Schafner', 'Doe', 'Doe'],
    'email': ['Corey@gmail.com', 'Jane@gmail.com', 'Hale@gmail.com']
}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)

In [6]:
df

   first      last            email
0  Corey  Schafner  Corey@gmail.com
1   Jane       Doe   Jane@gmail.com
2   Hale       Doe   Hale@gmail.com

# Combining Columns

In [7]:
df['first'] + " " + df['last']

0    Corey Schafner
1          Jane Doe
2          Hale Doe
dtype: object

# Creating new column

In [8]:
df['full_name'] = df['first'] + " " + df['last']

In [9]:
df

   first      last            email       full_name
0  Corey  Schafner  Corey@gmail.com  Corey Schafner
1   Jane       Doe   Jane@gmail.com        Jane Doe
2   Hale       Doe   Hale@gmail.com        Hale Doe

# Removing columns

In [10]:
df.drop(columns=['first', 'last']) #not inplace

             email       full_name
0  Corey@gmail.com  Corey Schafner
1   Jane@gmail.com        Jane Doe
2   Hale@gmail.com        Hale Doe

In [11]:
df.drop(columns=['first', 'last'], inplace=True)

In [12]:
df

             email       full_name
0  Corey@gmail.com  Corey Schafner
1   Jane@gmail.com        Jane Doe
2   Hale@gmail.com        Hale Doe

### Splitting full_name to first and last column to reverse the above

In [17]:
df['full_name'].str.split()

#or df['full_name'].str.split(' ')

0    [Corey, Schafner]
1          [Jane, Doe]
2          [Hale, Doe]
Name: full_name, dtype: object

In [18]:
df['full_name'].str.split(' ', expand=True)

       0         1
0  Corey  Schafner
1   Jane       Doe
2   Hale       Doe

In [19]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

df

             email       full_name  first      last
0  Corey@gmail.com  Corey Schafner  Corey  Schafner
1   Jane@gmail.com        Jane Doe   Jane       Doe
2   Hale@gmail.com        Hale Doe   Hale       Doe

# Adding / Removing rows

## Adding
### append()

In [22]:
df.append({'first': 'Tony'})

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [23]:
df.append({'first': 'Tony'}, ignore_index=True)

             email       full_name  first      last
0  Corey@gmail.com  Corey Schafner  Corey  Schafner
1   Jane@gmail.com        Jane Doe   Jane       Doe
2   Hale@gmail.com        Hale Doe   Hale       Doe
3              NaN             NaN   Tony       NaN

In [32]:
new_person = pd.Series({'email': 'tony@gba.com', 'full_name': 'Tony Stark', 'first': 'Tony', 'last': 'Stark'})

In [33]:
df = df.append(new_person, ignore_index=True)

In [34]:
df

             email       full_name  first      last
0  Corey@gmail.com  Corey Schafner  Corey  Schafner
1   Jane@gmail.com        Jane Doe   Jane       Doe
2   Hale@gmail.com        Hale Doe   Hale       Doe
3     tony@gba.com      Tony Stark   Tony     Stark

## Removing

In [35]:
df.drop(index=3, inplace=True)

df

             email       full_name  first      last
0  Corey@gmail.com  Corey Schafner  Corey  Schafner
1   Jane@gmail.com        Jane Doe   Jane       Doe
2   Hale@gmail.com        Hale Doe   Hale       Doe

In [38]:
df[df['last'] == 'Doe'].index

Int64Index([1, 2], dtype='int64')

In [41]:
df.drop(index=df[df['last'] == 'Doe'].index) # not inplace

             email       full_name  first      last
0  Corey@gmail.com  Corey Schafner  Corey  Schafner

In [43]:
df

             email       full_name  first      last
0  Corey@gmail.com  Corey Schafner  Corey  Schafner
1   Jane@gmail.com        Jane Doe   Jane       Doe
2   Hale@gmail.com        Hale Doe   Hale       Doe

In [44]:
df.drop(index=df[df['last'] == 'Doe'].index, inplace=True)